{"modelTopology": {"keras_version": "2.1.3", "model_config": {"class_name": "Model", "config": {"layers": [{"class_name": "InputLayer", "inbound_nodes": [], "config": {"dtype": "float32", "batch_input_shape": [null, 224, 224, 3], "name": "input_1", "sparse": false}, "name": "input_1"}, {"class_name": "Conv2D", "inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [2, 2], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "conv1"}, {"class_name": "Activation", "inbound_nodes": [[["conv1", 0, 0, {}]]], "config": {"activation": "relu", "trainable": true, "name": "relu_conv1"}, "name": "relu_conv1"}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["relu_conv1", 0, 0, {}]]], "config": {"name": "pool1", "trainable": true, "data_format": "channels_last", "pool_size": [3, 3], "padding": "valid", "strides": [2, 2]}, "name": "pool1"}, {"class_name": "Conv2D", "inbound_nodes": [[["pool1", 0, 0, {}]]], "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "fire2/squeeze1x1", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 16, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [1, 1]}, "name": "fire2/squeeze1x1"}, {"class_name": "Activation", "inbound_nodes": [[["fire2/squeeze1x1", 0, 0, {}]]], "config": {"activation": "relu", "trainable": true, "name": "fire2/relu_squeeze1x1"}, "name": "fire2/relu_squeeze1x1"}, {"class_name": "Conv2D", "inbound_nodes": [[["fire2/relu_squeeze1x1", 0, 0, {}]]], "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "fire2/expand1x1", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [1, 1]}, "name": "fire2/expand1x1"}, {"class_name": "Conv2D", "inbound_nodes": [[["fire2/relu_squeeze1x1", 0, 0, {}]]], "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "fire2/expand3x3", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "fire2/expand3x3"}, {"class_name": "Activation", "inbound_nodes": [[["fire2/expand1x1", 0, 0, {}]]], "config": {"activation": "relu", "trainable": true, "name": "fire2/relu_expand1x1"}, "name": "fire2/relu_expand1x1"}, {"class_name": "Activation", "inbound_nodes": [[["fire2/expand3x3", 0, 0, {}]]], "config": {"activation": "relu", "trainable": true, "name": "fire2/relu_expand3x3"}, "name": "fire2/relu_expand3x3"}, {"class_name": "Concatenate", "inbound_nodes": [[["fire2/relu_expand1x1", 0, 0, {}], ["fire2/relu_expand3x3", 0, 0, {}]]], "config": {"trainable": true, "name": "fire2/concat", "axis": 3}, "name": "fire2/concat"}, {"class_name": "Conv2D", "inbound_nodes": [[["fire2/concat", 0, 0, {}]]], "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "fire3/squeeze1x1", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 16, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [1, 1]}, "name": "fire3/squeeze1x1"}, {"class_name": "Activation", "inbound_nodes": [[["fire3/squeeze1x1", 0, 0, {}]]], "config": {"activation": "relu", "trainable": true, "name": "fire3/relu_squeeze1x1"}, "name": "fire3/relu_squeeze1x1"}, {"class_name": "Conv2D", "inbound_nodes": [[["fire3/relu_squeeze1x1", 0, 0, {}]]], "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "fire3/expand1x1", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [1, 1]}, "name": "fire3/expand1x1"}, {"class_name": "Conv2D", "inbound_nodes": [[["fire3/relu_squeeze1x1", 0, 0, {}]]], "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "fire3/expand3x3", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "fire3/expand3x3"}, {"class_name": "Activation", "inbound_nodes": [[["fire3/expand1x1", 0, 0, {}]]], "config": {"activation": "relu", "trainable": true, "name": "fire3/relu_expand1x1"}, "name": "fire3/relu_expand1x1"}, {"class_name": "Activation", "inbound_nodes": [[["fire3/expand3x3", 0, 0, {}]]], "config": {"activation": "relu", "trainable": true, "name": "fire3/relu_expand3x3"}, "name": "fire3/relu_expand3x3"}, {"class_name": "Concatenate", "inbound_nodes": [[["fire3/relu_expand1x1", 0, 0, {}], ["fire3/relu_expand3x3", 0, 0, {}]]], "config": {"trainable": true, "name": "fire3/concat", "axis": 3}, "name": "fire3/concat"}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["fire3/concat", 0, 0, {}]]], "config": {"name": "pool3", "trainable": true, "data_format": "channels_last", "pool_size": [3, 3], "padding": "valid", "strides": [2, 2]}, "name": "pool3"}, {"class_name": "Conv2D", "inbound_nodes": [[["pool3", 0, 0, {}]]], "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "fire4/squeeze1x1", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [1, 1]}, "name": "fire4/squeeze1x1"}, {"class_name": "Activation", "inbound_nodes": [[["fire4/squeeze1x1", 0, 0, {}]]], "config": {"activation": "relu", "trainable": true, "name": "fire4/relu_squeeze1x1"}, "name": "fire4/relu_squeeze1x1"}, {"class_name": "Conv2D", "inbound_nodes": [[["fire4/relu_squeeze1x1", 0, 0, {}]]], "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "fire4/expand1x1", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [1, 1]}, "name": "fire4/expand1x1"}, {"class_name": "Conv2D", "inbound_nodes": [[["fire4/relu_squeeze1x1", 0, 0, {}]]], "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "fire4/expand3x3", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "fire4/expand3x3"}, {"class_name": "Activation", "inbound_nodes": [[["fire4/expand1x1", 0, 0, {}]]], "config": {"activation": "relu", "trainable": true, "name": "fire4/relu_expand1x1"}, "name": "fire4/relu_expand1x1"}, {"class_name": "Activation", "inbound_nodes": [[["fire4/expand3x3", 0, 0, {}]]], "config": {"activation": "relu", "trainable": true, "name": "fire4/relu_expand3x3"}, "name": "fire4/relu_expand3x3"}, {"class_name": "Concatenate", "inbound_nodes": [[["fire4/relu_expand1x1", 0, 0, {}], ["fire4/relu_expand3x3", 0, 0, {}]]], "config": {"trainable": true, "name": "fire4/concat", "axis": 3}, "name": "fire4/concat"}, {"class_name": "Conv2D", "inbound_nodes": [[["fire4/concat", 0, 0, {}]]], "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "fire5/squeeze1x1", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [1, 1]}, "name": "fire5/squeeze1x1"}, {"class_name": "Activation", "inbound_nodes": [[["fire5/squeeze1x1", 0, 0, {}]]], "config": {"activation": "relu", "trainable": true, "name": "fire5/relu_squeeze1x1"}, "name": "fire5/relu_squeeze1x1"}, {"class_name": "Conv2D", "inbound_nodes": [[["fire5/relu_squeeze1x1", 0, 0, {}]]], "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "fire5/expand1x1", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [1, 1]}, "name": "fire5/expand1x1"}, {"class_name": "Conv2D", "inbound_nodes": [[["fire5/relu_squeeze1x1", 0, 0, {}]]], "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "fire5/expand3x3", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "fire5/expand3x3"}, {"class_name": "Activation", "inbound_nodes": [[["fire5/expand1x1", 0, 0, {}]]], "config": {"activation": "relu", "trainable": true, "name": "fire5/relu_expand1x1"}, "name": "fire5/relu_expand1x1"}, {"class_name": "Activation", "inbound_nodes": [[["fire5/expand3x3", 0, 0, {}]]], "config": {"activation": "relu", "trainable": true, "name": "fire5/relu_expand3x3"}, "name": "fire5/relu_expand3x3"}, {"class_name": "Concatenate", "inbound_nodes": [[["fire5/relu_expand1x1", 0, 0, {}], ["fire5/relu_expand3x3", 0, 0, {}]]], "config": {"trainable": true, "name": "fire5/concat", "axis": 3}, "name": "fire5/concat"}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["fire5/concat", 0, 0, {}]]], "config": {"name": "pool5", "trainable": true, "data_format": "channels_last", "pool_size": [3, 3], "padding": "valid", "strides": [2, 2]}, "name": "pool5"}, {"class_name": "Conv2D", "inbound_nodes": [[["pool5", 0, 0, {}]]], "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "fire6/squeeze1x1", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 48, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [1, 1]}, "name": "fire6/squeeze1x1"}, {"class_name": "Activation", "inbound_nodes": [[["fire6/squeeze1x1", 0, 0, {}]]], "config": {"activation": "relu", "trainable": true, "name": "fire6/relu_squeeze1x1"}, "name": "fire6/relu_squeeze1x1"}, {"class_name": "Conv2D", "inbound_nodes": [[["fire6/relu_squeeze1x1", 0, 0, {}]]], "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "fire6/expand1x1", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 192, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [1, 1]}, "name": "fire6/expand1x1"}, {"class_name": "Conv2D", "inbound_nodes": [[["fire6/relu_squeeze1x1", 0, 0, {}]]], "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "fire6/expand3x3", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 192, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "fire6/expand3x3"}, {"class_name": "Activation", "inbound_nodes": [[["fire6/expand1x1", 0, 0, {}]]], "config": {"activation": "relu", "trainable": true, "name": "fire6/relu_expand1x1"}, "name": "fire6/relu_expand1x1"}, {"class_name": "Activation", "inbound_nodes": [[["fire6/expand3x3", 0, 0, {}]]], "config": {"activation": "relu", "trainable": true, "name": "fire6/relu_expand3x3"}, "name": "fire6/relu_expand3x3"}, {"class_name": "Concatenate", "inbound_nodes": [[["fire6/relu_expand1x1", 0, 0, {}], ["fire6/relu_expand3x3", 0, 0, {}]]], "config": {"trainable": true, "name": "fire6/concat", "axis": 3}, "name": "fire6/concat"}, {"class_name": "Conv2D", "inbound_nodes": [[["fire6/concat", 0, 0, {}]]], "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "fire7/squeeze1x1", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 48, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [1, 1]}, "name": "fire7/squeeze1x1"}, {"class_name": "Activation", "inbound_nodes": [[["fire7/squeeze1x1", 0, 0, {}]]], "config": {"activation": "relu", "trainable": true, "name": "fire7/relu_squeeze1x1"}, "name": "fire7/relu_squeeze1x1"}, {"class_name": "Conv2D", "inbound_nodes": [[["fire7/relu_squeeze1x1", 0, 0, {}]]], "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "fire7/expand1x1", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 192, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [1, 1]}, "name": "fire7/expand1x1"}, {"class_name": "Conv2D", "inbound_nodes": [[["fire7/relu_squeeze1x1", 0, 0, {}]]], "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "fire7/expand3x3", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 192, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "fire7/expand3x3"}, {"class_name": "Activation", "inbound_nodes": [[["fire7/expand1x1", 0, 0, {}]]], "config": {"activation": "relu", "trainable": true, "name": "fire7/relu_expand1x1"}, "name": "fire7/relu_expand1x1"}, {"class_name": "Activation", "inbound_nodes": [[["fire7/expand3x3", 0, 0, {}]]], "config": {"activation": "relu", "trainable": true, "name": "fire7/relu_expand3x3"}, "name": "fire7/relu_expand3x3"}, {"class_name": "Concatenate", "inbound_nodes": [[["fire7/relu_expand1x1", 0, 0, {}], ["fire7/relu_expand3x3", 0, 0, {}]]], "config": {"trainable": true, "name": "fire7/concat", "axis": 3}, "name": "fire7/concat"}, {"class_name": "Conv2D", "inbound_nodes": [[["fire7/concat", 0, 0, {}]]], "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "fire8/squeeze1x1", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [1, 1]}, "name": "fire8/squeeze1x1"}, {"class_name": "Activation", "inbound_nodes": [[["fire8/squeeze1x1", 0, 0, {}]]], "config": {"activation": "relu", "trainable": true, "name": "fire8/relu_squeeze1x1"}, "name": "fire8/relu_squeeze1x1"}, {"class_name": "Conv2D", "inbound_nodes": [[["fire8/relu_squeeze1x1", 0, 0, {}]]], "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "fire8/expand1x1", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 256, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [1, 1]}, "name": "fire8/expand1x1"}, {"class_name": "Conv2D", "inbound_nodes": [[["fire8/relu_squeeze1x1", 0, 0, {}]]], "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "fire8/expand3x3", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 256, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "fire8/expand3x3"}, {"class_name": "Activation", "inbound_nodes": [[["fire8/expand1x1", 0, 0, {}]]], "config": {"activation": "relu", "trainable": true, "name": "fire8/relu_expand1x1"}, "name": "fire8/relu_expand1x1"}, {"class_name": "Activation", "inbound_nodes": [[["fire8/expand3x3", 0, 0, {}]]], "config": {"activation": "relu", "trainable": true, "name": "fire8/relu_expand3x3"}, "name": "fire8/relu_expand3x3"}, {"class_name": "Concatenate", "inbound_nodes": [[["fire8/relu_expand1x1", 0, 0, {}], ["fire8/relu_expand3x3", 0, 0, {}]]], "config": {"trainable": true, "name": "fire8/concat", "axis": 3}, "name": "fire8/concat"}, {"class_name": "Conv2D", "inbound_nodes": [[["fire8/concat", 0, 0, {}]]], "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "fire9/squeeze1x1", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [1, 1]}, "name": "fire9/squeeze1x1"}, {"class_name": "Activation", "inbound_nodes": [[["fire9/squeeze1x1", 0, 0, {}]]], "config": {"activation": "relu", "trainable": true, "name": "fire9/relu_squeeze1x1"}, "name": "fire9/relu_squeeze1x1"}, {"class_name": "Conv2D", "inbound_nodes": [[["fire9/relu_squeeze1x1", 0, 0, {}]]], "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "fire9/expand3x3", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 256, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "fire9/expand3x3"}, {"class_name": "Activation", "inbound_nodes": [[["fire9/expand3x3", 0, 0, {}]]], "config": {"activation": "relu", "trainable": true, "name": "fire9/relu_expand3x3"}, "name": "fire9/relu_expand3x3"}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["fire9/relu_expand3x3", 0, 0, {}]]], "config": {"name": "max_pooling2d_1", "trainable": true, "data_format": "channels_last", "pool_size": [2, 2], "padding": "same", "strides": [2, 2]}, "name": "max_pooling2d_1"}], "output_layers": [["max_pooling2d_1", 0, 0]], "name": "modified_squeezenet", "input_layers": [["input_1", 0, 0]]}}, "backend": "tensorflow"}, "weightsManifest": [{"paths": ["squeezenet_group1-shard1of1"], "weights": [{"dtype": "float32", "shape": [3, 3, 3, 64], "name": "conv1/kernel"}, {"dtype": "float32", "shape": [64], "name": "conv1/bias"}, {"dtype": "float32", "shape": [1, 1, 16, 64], "name": "fire2/expand1x1/kernel"}, {"dtype": "float32", "shape": [64], "name": "fire2/expand1x1/bias"}, {"dtype": "float32", "shape": [3, 3, 16, 64], "name": "fire2/expand3x3/kernel"}, {"dtype": "float32", "shape": [64], "name": "fire2/expand3x3/bias"}, {"dtype": "float32", "shape": [1, 1, 64, 16], "name": "fire2/squeeze1x1/kernel"}, {"dtype": "float32", "shape": [16], "name": "fire2/squeeze1x1/bias"}, {"dtype": "float32", "shape": [1, 1, 16, 64], "name": "fire3/expand1x1/kernel"}, {"dtype": "float32", "shape": [64], "name": "fire3/expand1x1/bias"}, {"dtype": "float32", "shape": [3, 3, 16, 64], "name": "fire3/expand3x3/kernel"}, {"dtype": "float32", "shape": [64], "name": "fire3/expand3x3/bias"}, {"dtype": "float32", "shape": [1, 1, 128, 16], "name": "fire3/squeeze1x1/kernel"}, {"dtype": "float32", "shape": [16], "name": "fire3/squeeze1x1/bias"}, {"dtype": "float32", "shape": [1, 1, 32, 128], "name": "fire4/expand1x1/kernel"}, {"dtype": "float32", "shape": [128], "name": "fire4/expand1x1/bias"}, {"dtype": "float32", "shape": [3, 3, 32, 128], "name": "fire4/expand3x3/kernel"}, {"dtype": "float32", "shape": [128], "name": "fire4/expand3x3/bias"}, {"dtype": "float32", "shape": [1, 1, 128, 32], "name": "fire4/squeeze1x1/kernel"}, {"dtype": "float32", "shape": [32], "name": "fire4/squeeze1x1/bias"}, {"dtype": "float32", "shape": [1, 1, 32, 128], "name": "fire5/expand1x1/kernel"}, {"dtype": "float32", "shape": [128], "name": "fire5/expand1x1/bias"}, {"dtype": "float32", "shape": [3, 3, 32, 128], "name": "fire5/expand3x3/kernel"}, {"dtype": "float32", "shape": [128], "name": "fire5/expand3x3/bias"}, {"dtype": "float32", "shape": [1, 1, 256, 32], "name": "fire5/squeeze1x1/kernel"}, {"dtype": "float32", "shape": [32], "name": "fire5/squeeze1x1/bias"}, {"dtype": "float32", "shape": [1, 1, 48, 192], "name": "fire6/expand1x1/kernel"}, {"dtype": "float32", "shape": [192], "name": "fire6/expand1x1/bias"}, {"dtype": "float32", "shape": [3, 3, 48, 192], "name": "fire6/expand3x3/kernel"}, {"dtype": "float32", "shape": [192], "name": "fire6/expand3x3/bias"}, {"dtype": "float32", "shape": [1, 1, 256, 48], "name": "fire6/squeeze1x1/kernel"}, {"dtype": "float32", "shape": [48], "name": "fire6/squeeze1x1/bias"}, {"dtype": "float32", "shape": [1, 1, 48, 192], "name": "fire7/expand1x1/kernel"}, {"dtype": "float32", "shape": [192], "name": "fire7/expand1x1/bias"}, {"dtype": "float32", "shape": [3, 3, 48, 192], "name": "fire7/expand3x3/kernel"}, {"dtype": "float32", "shape": [192], "name": "fire7/expand3x3/bias"}, {"dtype": "float32", "shape": [1, 1, 384, 48], "name": "fire7/squeeze1x1/kernel"}, {"dtype": "float32", "shape": [48], "name": "fire7/squeeze1x1/bias"}, {"dtype": "float32", "shape": [1, 1, 64, 256], "name": "fire8/expand1x1/kernel"}, {"dtype": "float32", "shape": [256], "name": "fire8/expand1x1/bias"}, {"dtype": "float32", "shape": [3, 3, 64, 256], "name": "fire8/expand3x3/kernel"}, {"dtype": "float32", "shape": [256], "name": "fire8/expand3x3/bias"}, {"dtype": "float32", "shape": [1, 1, 384, 64], "name": "fire8/squeeze1x1/kernel"}, {"dtype": "float32", "shape": [64], "name": "fire8/squeeze1x1/bias"}, {"dtype": "float32", "shape": [3, 3, 64, 256], "name": "fire9/expand3x3/kernel"}, {"dtype": "float32", "shape": [256], "name": "fire9/expand3x3/bias"}, {"dtype": "float32", "shape": [1, 1, 512, 64], "name": "fire9/squeeze1x1/kernel"}, {"dtype": "float32", "shape": [64], "name": "fire9/squeeze1x1/bias"}]}]}